📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-dzj4.bolt.host/conditions-utilisation

Extracted content:
```json
{
    "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
    "url": "https://somet1010-montoit-st-dzj4.bolt.host/conditions-utilisation",
    "summary": "Ce document contient les Conditions Générales d'Utilisation (CGU) de Mon Toit, une plateforme en ligne dédiée à la mise en relation de propriétaires et locataires de biens immobiliers en Côte d'Ivoire. Il détaille les règles d'utilisation de la plateforme, les obligations des utilisateurs, les services proposés, les responsabilités de Mon Toit en tant qu'intermédiaire, la protection des données personnelles, la propriété intellectuelle, les modalités de modification des CGU, et le droit applicable. La dernière mise à jour est datée de Novembre 2025.",
    "key_points": [
        {
            "section": "Dernière mise à jour",
            "content": "Novembre 2025."
        },
        {
            "section": "1. Objet",
            "content": "Les CGU régissent l'utilisation de la plateforme Mon Toit, un service en ligne de mise en relation entre propriétaires et locataires de biens immobiliers en Côte d'Ivoire."
        },
        {
            "section": "2. Acceptation des Conditions",
            "content": "L'utilisation de la plateforme implique l'acceptation pleine et entière des CGU. Tout utilisateur refusant ces conditions doit s'abstenir d'utiliser les services."
        },
        {
            "section": "3. Inscription et Compte Utilisateur",
            "content": [
                "L'inscription est gratuite et réservée aux personnes majeures.",
                "Les informations fournies doivent être exactes et à jour.",
                "Chaque utilisateur est responsable de la confidentialité de son mot de passe.",
                "La vérification d'identité via ONECI est obligatoire pour certaines transactions."
            ]
        },
        {
            "section": "4. Services Proposés",
            "content": [
                "Publication et consultation d'annonces immobilières.",
                "Mise en relation entre propriétaires et locataires.",
                "Signature électronique de contrats de bail.",
                "Gestion des paiements via Mobile Money.",
                "Vérification d'identité et certification."
            ]
        },
        {
            "section": "5. Obligations des Utilisateurs",
            "content": [
                "Fournir des informations véridiques et complètes.",
                "Ne publier que des annonces authentiques.",
                "Respecter les droits de propriété intellectuelle.",
                "Ne pas tenter de contourner les systèmes de sécurité.",
                "Utiliser la plateforme de manière loyale et conforme à la loi."
            ]
        },
        {
            "section": "6. Propriété Intellectuelle",
            "content": "Tous les éléments de la plateforme Mon Toit (logos, textes, graphiques, logiciels) sont protégés par le droit de la propriété intellectuelle. Toute reproduction non autorisée est strictement interdite."
        },
        {
            "section": "7. Responsabilité",
            "content": "Mon Toit agit en qualité d'intermédiaire et ne peut être tenu responsable de l'exactitude des annonces publiées par les utilisateurs, des litiges entre utilisateurs, des interruptions temporaires de service, ou des actes frauduleux commis par des tiers."
        },
        {
            "section": "8. Protection des Données",
            "content": "Les données personnelles collectées sont traitées conformément à la Politique de Confidentialité de Mon Toit et aux dispositions de la loi ivoirienne sur la protection des données personnelles."
        },
        {
            "section": "9. Modification des CGU",
            "content": "Mon Toit se réserve le droit de modifier les CGU à tout moment. Les utilisateurs seront informés de toute modification substantielle par email ou notification sur la plateforme."
        },
        {
            "section": "10. Droit Applicable",
            "content": "Les présentes CGU sont régies par le droit ivoirien. Tout litige sera soumis aux tribunaux compétents de Côte d'Ivoire."
        },
        {
            "section": "Contact pour questions",
            "content": "Pour toute question concernant ces conditions d'utilisation, veuillez contacter contact@mon-toit.ci."
        }
    ],
    "relevant_links": [
        "mailto:contact@mon-toit.ci",
        "/politique-confidentialite",
        "/mentions-legales",
        "/cgv"
    ],
    "file_name": "mon_toit_conditions_utilisation.json"
}
```
