📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-dzj4.bolt.host/a-propos

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-dzj4.bolt.host/a-propos",
  "summary": "Mon Toit est une plateforme immobilière innovante en Côte d'Ivoire, spécialisée dans la location. Elle vise à simplifier, sécuriser et rendre transparent l'accès au logement pour les Ivoiriens en connectant propriétaires et locataires via une plateforme digitale moderne. La plateforme intègre des technologies clés comme la signature électronique sécurisée et la vérification d'identité officielle pour garantir la confiance et la sécurité des transactions immobilières.",
  "key_points": [
    "Plateforme immobilière innovante pour faciliter l'accès au logement en Côte d'Ivoire.",
    "Utilisation de la signature électronique sécurisée et de la vérification d'identité officielle (via ONECI).",
    "Mission: Rendre l'accès au logement simple, transparent et sécurisé pour tous les Ivoiriens.",
    "Garanties offertes: Vérification d'identité officielle, signature électronique légale conforme à la réglementation ivoirienne, paiement sécurisé via Mobile Money (Orange, MTN, Moov), et cachet électronique visible sur tous les contrats.",
    "Valeurs: Transparence, Sécurité, Accessibilité, Innovation.",
    "Sécurité et Conformité: Respect des normes nationales, utilisation de CryptoNeo pour la signature électronique, possibilité de demander un Certificat Électronique de Vérification (CEV) auprès de l'ONECI.",
    "Informations de contact: Email (contact@mon-toit.ci), Adresse (Abidjan, Côte d'Ivoire).",
    "Certifié ANSUT."
  ],
  "relevant_links": [
    "/",
    "/recherche",
    "/connexion",
    "/inscription",
    "/a-propos",
    "/comment-ca-marche",
    "/contact",
    "/conditions-utilisation",
    "/politique-confidentialite",
    "/mentions-legales",
    "/cgv",
    "/aide",
    "/faq",
    "/blog"
  ],
  "file_name": "mon_toit_a_propos.json"
}
```
