📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-jcvj.bolt.host/politique-confidentialite

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-jcvj.bolt.host/politique-confidentialite",
  "summary": "Cette page est la Politique de Confidentialité de Mon Toit, une plateforme immobilière certifiée ANSUT en Côte d'Ivoire. Elle détaille comment la plateforme collecte, utilise, protège et partage les données personnelles de ses utilisateurs, conformément à la réglementation ivoirienne. Le document couvre les types de données collectées (identification, contact, compte, transaction, techniques), les finalités de leur traitement (gestion de compte, mise en relation, vérification d'identité via ONECI, paiements sécurisés, amélioration des services, conformité légale), les mesures de sécurité mises en place (cryptage, authentification, contrôles d'accès), le partage de données (avec ONECI, prestataires de paiement, ANSUT, autorités légales) sans jamais les vendre à des tiers, les droits des utilisateurs (accès, rectification, opposition, effacement, portabilité), la durée de conservation des données, l'utilisation de cookies, les modalités de modification de la politique et les informations de contact.",
  "key_points": [
    "La page actuelle est la Politique de Confidentialité de Mon Toit.",
    "Mon Toit est une plateforme immobilière certifiée ANSUT en Côte d'Ivoire.",
    "Elle collecte des données d'identification, de contact, de compte, de transaction et techniques.",
    "Les données sont utilisées pour la gestion des comptes, la mise en relation propriétaires-locataires, la vérification d'identité (ONECI), les paiements et l'amélioration des services.",
    "Des mesures de sécurité robustes sont implémentées, incluant le cryptage (SSL/TLS) et l'authentification à double facteur.",
    "Les données peuvent être partagées avec ONECI, des prestataires de paiement et l'ANSUT, mais ne sont jamais vendues à des tiers.",
    "Les utilisateurs disposent de droits d'accès, de rectification, d'opposition, d'effacement et de portabilité.",
    "Les données sont conservées pour la durée nécessaire ou selon les exigences légales (ex: 5 ans pour les données de bail après la fin du contrat).",
    "Le site utilise des cookies et la politique peut être modifiée avec notification aux utilisateurs.",
    "Le contact pour la protection des données est privacy@mon-toit.ci."
  ],
  "relevant_links": [
    "https://somet1010-montoit-st-jcvj.bolt.host/",
    "https://somet1010-montoit-st-jcvj.bolt.host/recherche",
    "https://somet1010-montoit-st-jcvj.bolt.host/connexion",
    "https://somet1010-montoit-st-jcvj.bolt.host/inscription",
    "https://somet1010-montoit-st-jcvj.bolt.host/a-propos",
    "https://somet1010-montoit-st-jcvj.bolt.host/comment-ca-marche",
    "https://somet1010-montoit-st-jcvj.bolt.host/contact",
    "https://somet1010-montoit-st-jcvj.bolt.host/conditions-utilisation",
    "https://somet1010-montoit-st-jcvj.bolt.host/mentions-legales",
    "https://somet1010-montoit-st-jcvj.bolt.host/cgv",
    "mailto:privacy@mon-toit.ci",
    "https://somet1010-montoit-st-jcvj.bolt.host/aide",
    "https://somet1010-montoit-st-jcvj.bolt.host/faq",
    "https://somet1010-montoit-st-jcvj.bolt.host/blog"
  ],
  "file_name": "mon_toit_politique_confidentialite.json"
}
```
