📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-dzj4.bolt.host/a-propos

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-dzj4.bolt.host/a-propos",
  "summary": "Mon Toit est une plateforme immobilière innovante en Côte d'Ivoire dédiée à simplifier, sécuriser et rendre transparent l'accès au logement. Elle connecte propriétaires et locataires en utilisant la signature électronique sécurisée et la vérification d'identité officielle via l'ONECI. Sa mission est de rendre l'accès au logement plus simple, transparent et sécurisé pour tous les Ivoiriens, en garantissant la confiance et la sécurité des transactions. La plateforme offre des garanties telles que la vérification d'identité, des contrats légaux, des paiements sécurisés via Mobile Money et un cachet électronique visible. Elle promeut les valeurs de transparence, sécurité, accessibilité et innovation, tout en respectant les normes nationales de conformité et de protection des utilisateurs, notamment par l'utilisation de CryptoNeo pour la signature électronique.",
  "key_points": [
    "Mon Toit est une plateforme immobilière innovante en Côte d'Ivoire.",
    "Facilite l'accès au logement grâce à la signature électronique sécurisée et la vérification d'identité officielle (ONECI).",
    "Mission : Rendre l'accès au logement plus simple, transparent et sécurisé pour tous les Ivoiriens.",
    "Garanties : Vérification d'identité officielle, signature électronique légale, paiement sécurisé (Mobile Money), cachet électronique visible.",
    "Valeurs : Transparence, Sécurité, Accessibilité, Innovation.",
    "Respecte les normes nationales en matière de services numériques et utilise CryptoNeo pour la signature électronique.",
    "Possibilité de demander un Certificat Électronique de Vérification (CEV) auprès de l'ONECI.",
    "Contact : contact@mon-toit.ci, Abidjan, Côte d'Ivoire."
  ],
  "relevant_links": [
    "mailto:contact@mon-toit.ci",
    "/",
    "/recherche",
    "/a-propos",
    "/comment-ca-marche",
    "/contact",
    "/conditions-utilisation",
    "/politique-confidentialite",
    "/mentions-legales",
    "/cgv",
    "/aide",
    "/faq",
    "/blog"
  ],
  "file_name": "mon_toit_a_propos.json"
}
```
