📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-jcvj.bolt.host/proprietes/34cb9f03-4e4b-4da5-8633-8102348838f6

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-jcvj.bolt.host/proprietes/34cb9f03-4e4b-4da5-8633-8102348838f6",
  "summary": "This page is a property listing on the 'Mon Toit' real estate platform for Côte d'Ivoire, featuring a 'Appartement Duplex Angré 8ème' located in Abidjan, Cocody. The duplex is available for 650,000 FCFA per month, has 3 bedrooms, 3 bathrooms, and covers 180m². It boasts a vast living room, equipped kitchen, parental suite, panoramic terrace, and centralized air conditioning. The residence also includes a common swimming pool and a gym. The page provides options to apply, schedule a visit, or contact the owner, alongside important security advice for potential renters. The footer contains navigation links, contact information, and legal disclaimers. Based on the provided content, no JavaScript code, direct references to third-party services like Supabase or Mapbox, nor any API keys or sensitive configurations are exposed.",
  "key_points": [
    "Property Name: Appartement Duplex Angré 8ème",
    "Location: Abidjan, Cocody",
    "Monthly Rent: 650,000 FCFA",
    "Property Specifications: 3 bedrooms, 3 bathrooms, 180m² surface area, apartment type",
    "Features: New duplex, vast living room, equipped kitchen, parental suite, panoramic terrace, centralized air conditioning, residence with common pool and gym.",
    "Interaction Options: Apply now, Schedule a visit, Contact (response typically within 24h).",
    "Security Advice: Always visit the property before paying, verify owner's identity, never pay in cash, use Mon Toit for all payments.",
    "Contact Information: +225 XX XX XX XX XX, contact@montoit.ci, Abidjan, Côte d'Ivoire",
    "No JavaScript code, third-party service references (like Supabase/Mapbox), or API keys/configurations were found in the provided page content."
  ],
  "relevant_links": [
    "/",
    "/recherche",
    "/connexion",
    "/inscription",
    "/a-propos",
    "/comment-ca-marche",
    "/contact",
    "/conditions-utilisation",
    "/politique-confidentialite",
    "/mentions-legales",
    "/cgv",
    "/aide",
    "/faq",
    "/blog"
  ],
  "file_name": "montoit_property_listing.json"
}
```
