 Extracted from page: Mon Toit - Trouvez Votre Logement Id茅al en C么te d'Ivoire | Abidjan, Yamoussoukro
URL: https://somet1010-montoit-st-jcvj.bolt.host/

Extracted content:
```json
{
  "title": "Mon Toit - Trouvez Votre Logement Id茅al en C么te d'Ivoire | Abidjan, Yamoussoukro",
  "url": "https://somet1010-montoit-st-jcvj.bolt.host/",
  "summary": "The page describes 'Mon Toit', a certified real estate platform in C么te d'Ivoire (Abidjan, Yamoussoukro) designed to help users find ideal housing. It highlights features such as secure rentals, verified identities (ANSUT certification), and mobile payment options (Orange Money, MTN Money, Moov Money). The platform offers various property types like apartments, houses, villas, studios, offices, and land. It showcases recent property listings with details, testimonials from satisfied customers, and key statistics about its operations. 'Mon Toit' emphasizes user support and aims to provide a safe and modern experience for both renters and property owners.",
  "key_points": [
    "Mon Toit is a certified real estate platform in C么te d'Ivoire (Abidjan, Yamoussoukro).",
    "Key features include secure rentals, verified identity (ANSUT certification), and mobile payment (Orange, MTN, Moov Money).",
    "Offers various property types: apartments, houses, villas, studios, offices, and land.",
    "Showcases recent property listings, primarily in Abidjan (Cocody, Angr茅, Riviera Golf, 2 Plateaux, Palmeraie).",
    "Highlights customer testimonials praising ease of use, security, and modern services.",
    "Provides 24/7 support for users.",
    "No information regarding Supabase URLs, API keys, configurations, or authentication methods was found on this page."
  ],
  "relevant_links": [
    "/",
    "/recherche",
    "/connexion",
    "/inscription",
    "/proprietes/34cb9f03-4e4b-4da5-8633-8102348838f6",
    "/proprietes/f8ba47c3-f5ed-455e-82a2-6afebb962eb1",
    "/proprietes/df31aa65-0e1e-43bb-a738-ae5f0b276d62",
    "/proprietes/2ea0bfe1-2a5c-41c4-a09f-77d2a2539325",
    "/proprietes/319017f1-4271-4836-8901-0d10061a4c6a",
    "/proprietes/b129098f-450e-4255-b30e-344246cc6861",
    "/inscription?redirect=/dashboard/ajouter-propriete",
    "/a-propos",
    "/comment-ca-marche",
    "/contact",
    "/conditions-utilisation",
    "/politique-confidentialite",
    "/mentions-legales",
    "/cgv",
    "/aide",
    "/faq",
    "/blog"
  ],
  "file_name": "montoit_page_content_summary.json"
}
```
