📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-dzj4.bolt.host/conditions-utilisation

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-dzj4.bolt.host/conditions-utilisation",
  "summary": "La page présente les Conditions Générales d'Utilisation (CGU) de la plateforme Mon Toit, un service en ligne de mise en relation entre propriétaires et locataires de biens immobiliers en Côte d'Ivoire. Le document, mis à jour en Novembre 2025, détaille les règles d'utilisation de la plateforme, de l'inscription à la responsabilité des parties, en passant par les services proposés, la propriété intellectuelle et la protection des données. Il souligne que l'utilisation de la plateforme implique l'acceptation pleine et entière de ces CGU et que le droit applicable est le droit ivoirien.",
  "key_points": [
    "Objet des CGU : Régir l'utilisation de la plateforme Mon Toit, service de mise en relation immobilière en Côte d'Ivoire.",
    "Acceptation des Conditions : L'utilisation de la plateforme vaut acceptation pleine et entière des CGU.",
    "Inscription et Compte Utilisateur : Inscription gratuite pour les majeurs, nécessité d'informations exactes, confidentialité du mot de passe et vérification d'identité ONECI pour certaines transactions.",
    "Services Proposés : Publication/consultation d'annonces, mise en relation, signature électronique de baux, gestion des paiements via Mobile Money, vérification et certification.",
    "Obligations des Utilisateurs : Fournir des informations véridiques, publier des annonces authentiques, respecter la propriété intellectuelle, ne pas contourner les sécurités, et utiliser la plateforme loyalement.",
    "Propriété Intellectuelle : Tous les éléments de Mon Toit sont protégés, reproduction non autorisée interdite.",
    "Responsabilité : Mon Toit agit en tant qu'intermédiaire et décline sa responsabilité sur l'exactitude des annonces, les litiges entre utilisateurs, les interruptions de service et les fraudes de tiers.",
    "Protection des Données : Traitement des données personnelles conforme à la Politique de Confidentialité et au droit ivoirien.",
    "Modification des CGU : Mon Toit se réserve le droit de modifier les CGU, les utilisateurs seront informés.",
    "Droit Applicable : Les CGU sont régies par le droit ivoirien, tout litige relève des tribunaux ivoiriens."
  ],
  "relevant_links": [
    {
      "text": "contact@mon-toit.ci",
      "url": "mailto:contact@mon-toit.ci"
    },
    {
      "text": "Accueil",
      "url": "/"
    },
    {
      "text": "Rechercher",
      "url": "/recherche"
    },
    {
      "text": "À propos",
      "url": "/a-propos"
    },
    {
      "text": "Comment ça marche",
      "url": "/comment-ca-marche"
    },
    {
      "text": "Contact",
      "url": "/contact"
    },
    {
      "text": "Politique de confidentialité",
      "url": "/politique-confidentialite"
    },
    {
      "text": "Mentions légales",
      "url": "/mentions-legales"
    },
    {
      "text": "CGV",
      "url": "/cgv"
    },
    {
      "text": "Aide",
      "url": "/aide"
    },
    {
      "text": "FAQ",
      "url": "/faq"
    },
    {
      "text": "Blog",
      "url": "/blog"
    }
  ],
  "file_name": "montoit_conditions_utilisation.json"
}
```
