 Extracted from page: Mon Toit - Plateforme de Location Immobili猫re en C么te d'Ivoire
URL: https://somet1010-montoit-st-dzj4.bolt.host/a-propos

Extracted content:
```json
{
    "title": "Mon Toit - Plateforme de Location Immobili猫re en C么te d'Ivoire",
    "url": "https://somet1010-montoit-st-dzj4.bolt.host/a-propos",
    "summary": "This page, titled ' propos de Mon Toit' (About Mon Toit), describes an innovative real estate platform in C么te d'Ivoire. Its primary goal is to simplify, secure, and make transparent access to housing for Ivorians by connecting owners and tenants through a digital platform. Key features include secure electronic signatures, official identity verification via ONECI, and protected payments via Mobile Money. The platform emphasizes transparency, security, accessibility, and innovation, adhering to national digital service standards. It details its mission, guarantees (identity verification, legal e-signature, secure payment, electronic seal), and core values. Contact information (email, address) and various site links are also provided.",
    "key_points": [
        "Mon Toit is an innovative real estate platform in C么te d'Ivoire.",
        "Facilitates housing access through secure electronic signatures and official identity verification.",
        "Mission: Make housing access simple, transparent, and secure for all Ivorians.",
        "Guarantees include: Official identity verification (ONECI), legal electronic signature, secure Mobile Money payments (Orange, MTN, Moov), and visible electronic seals on contracts.",
        "Values: Transparency, Security, Accessibility, Innovation.",
        "Complies with national digital service standards and uses CryptoNeo for e-signatures.",
        "Users can request an optional Electronic Verification Certificate (CEV) from ONECI.",
        "Contact email: contact@mon-toit.ci, Address: Abidjan, C么te d'Ivoire."
    ],
    "relevant_links": [
        "/",
        "/recherche",
        "/connexion",
        "/inscription",
        "/a-propos",
        "/comment-ca-marche",
        "/contact",
        "/conditions-utilisation",
        "/politique-confidentialite",
        "/mentions-legales",
        "/cgv",
        "/aide",
        "/faq",
        "/blog"
    ],
    "file_name": "montoit_a_propos.json"
}
```
