📄 Extracted from page: GitHub - SOMET1010/MONTOIT-STABLE
URL: https://github.com/SOMET1010/MONTOIT-STABLE

Extracted content:
```json
{
  "title": "GitHub - SOMET1010/MONTOIT-STABLE",
  "url": "https://github.com/SOMET1010/MONTOIT-STABLE",
  "summary": "Le dépôt MONTOIT-STABLE par SOMET1010 héberge la plateforme de gestion locative \"Mon Toit\" pour la Côte d'Ivoire. Le projet est une application moderne construite avec React, TypeScript, et Supabase, mettant l'accent sur l'authentification sécurisée, la gestion de propriétés et la communication en temps réel. Il a récemment subi une refonte architecturale majeure (v3.3.0) et est en développement actif pour intégrer des fonctionnalités clés telles que la vérification d'identité (ONECI, CNAM, Smile ID), la signature électronique (CryptoNeo) et le paiement mobile Money. La structure du projet est bien organisée avec des dossiers dédiés aux composants, APIs, hooks, pages, et une documentation complète. Le dépôt suit les conventions de commit et utilise un pipeline CI/CD pour des déploiements automatisés vers des environnements de staging et de production.",
  "key_points": [
    "Nom du dépôt: MONTOIT-STABLE, Propriétaire: SOMET1010.",
    "Description: Plateforme moderne de gestion locative en Côte d'Ivoire avec cachet électronique visible, signature électronique et paiement mobile money.",
    "Technologies principales: Frontend (React 18.3, TypeScript 5.5, Vite 5.4, Tailwind CSS 3.4, Zustand 4.5, React Query 5.x) et Backend (Supabase avec PostgreSQL, Authentication, Storage, Edge Functions).",
    "Refonte architecturale majeure (v3.3.0) complétée, incluant React Router v6 (lazy loading), Repository Pattern, React Query hooks, Zustand, et routes protégées avec accès basé sur les rôles.",
    "Fonctionnalités actuelles: Authentification sécurisée, gestion de propriétés, messagerie en temps réel, planification de visites, candidatures locatives, système de scoring, favoris et alertes.",
    "Fonctionnalités en développement: Vérification d'identité (ANSUT/ONECI/CNAM/Smile ID), signature électronique (CryptoNeo), contrats numériques, certification CEV.",
    "Fonctionnalités planifiées: Paiement Mobile Money (Orange, MTN, Moov, Wave), notifications multi-canaux, carte interactive (Mapbox), dashboards et gestion d'agences immobilières.",
    "Structure des fichiers (répertoires principaux): `src/` (API, composants, hooks, pages, services, stores, types, utils), `supabase/` (functions, migrations), `docs/`, `public/`, `scripts/`, `tests/e2e/`, et des fichiers de configuration essentiels.",
    "Historique des commits récents (les plus récents en date du 25 novembre 2025): \"Updated stats.html\", \"Added SMILE_ID_REMOVAL_COMPLETE.md\", \"Updated package-lock.json\".",
    "Options pour pousser des modifications: Suivre le processus de contribution GitHub standard (fork, branche de fonctionnalité, commits, push, Pull Request) en utilisant les Conventional Commits. Le pipeline CI/CD de GitHub Actions automatise les déploiements (staging depuis `develop`, production depuis `main` après PR et tests).",
    "Sécurité: Row Level Security (RLS) activé, Supabase Auth, gestion des variables d'environnement, validation des entrées et HTTPS.",
    "Métriques et objectifs: Couverture de tests à 70%, optimisation de la taille du bundle, mode strict TypeScript, score Lighthouse >90."
  ],
  "relevant_links": [
    "https://github.com/SOMET1010/MONTOIT-STABLE/branches",
    "https://github.com/SOMET1010/MONTOIT-STABLE/tags",
    "https://github.com/SOMET1010/MONTOIT-STABLE/commits/main/",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/ARCHITECTURAL_REFACTORING_PHASE1_COMPLETE.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/NEW_ARCHITECTURE_QUICK_START.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/CHANGELOG.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/BACKLOG.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/docs/SECURITY.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/docs/DEPLOYMENT.md",
    "https://github.com/SOMET1010/MONTOIT-STABLE/blob/main/docs/guides/CONTRIBUTING.md",
    "https://www.conventionalcommits.org/",
    "https://github.com/SOMET1010/MONTOIT-STABLE/graphs/contributors",
    "https://www.typescriptlang.org/",
    "https://react.dev/",
    "https://supabase.com/"
  ],
  "file_name": "montoit_stable_details.json"
}
```
