📄 Extracted from page: My SeLoger Pro
URL: https://myselogerpro.com/cgu

Extracted content:
```json
{
  "title": "My SeLoger Pro - Conditions Générales d’Utilisation",
  "url": "https://myselogerpro.com/cgu",
  "summary": "Ce document détaille les Conditions Générales d'Utilisation (CGU) de la plateforme MySeLoger Pro, éditée par DIGITAL CLASSIFIEDS FRANCE, pour ses clients professionnels de l'immobilier. Il décrit les services offerts, tels que la gestion de compte, de portefeuille d'annonces, la visibilité, les statistiques, la gestion des contacts, et la vitrine digitale. Des services spécifiques comme l'achat de « Leads Vendeurs » et de « Boosts à l'unité » pour la mise en avant des annonces sont également présentés. Le document couvre également les aspects juridiques importants, incluant l'accès et la disponibilité des services, la propriété intellectuelle, la protection des données personnelles (conformément au RGPD via une annexe dédiée), les responsabilités des parties, les garanties, la force majeure, le système interne de traitement des plaintes, et les modalités de règlement des litiges.",
  "key_points": [
    "Les CGU définissent les conditions d'utilisation du site internet et de l'application MySeLoger Pro pour les Clients Professionnels.",
    "Services généraux incluent : gestion du compte et des collaborateurs, tableau de bord, portefeuille d’annonces, gestion de la visibilité des annonces, aperçu des statistiques de performance, gestion des contacts (acquéreurs, locataires, vendeurs), gestion de la vitrine digitale et un système de support/assistance.",
    "Le service « Leads Vendeurs » permet l'achat de contacts vendeurs qualifiés à l'unité, issus de formulaires d'estimation, avec des leads proposés géographiquement (rayon de 20 km ajusté dynamiquement). Les leads peuvent être exclusifs ou partagés et sont facturés mensuellement via Stripe. Des remboursements sont possibles sous conditions.",
    "Le service d'« Achats de Boosts à l’unité » permet d'acheter des crédits « Boost Liste » ou « Boost Extend + » pour améliorer la visibilité des annonces. Chaque crédit booste une annonce pendant 24 heures et est valable jusqu'à la fin du mois d'achat, non cumulable.",
    "L'accès aux services requiert des Codes d'Accès (identifiant et mot de passe), dont la sécurité relève de la responsabilité du Client Professionnel.",
    "La Société s'engage à une obligation de moyens concernant la disponibilité des services (24h/24, 7j/7), sous réserve de maintenance, mises à jour, problèmes de réseau ou cas de force majeure.",
    "La Société détient la propriété intellectuelle de la Plateforme et de ses contenus, accordant un droit d'utilisation limité. Les données du Client Professionnel restent sa propriété.",
    "Concernant les Données Personnelles, la Société agit en tant que sous-traitant (pour certaines données comme celles des collaborateurs) et responsable de traitement indépendant (pour d'autres données et des finalités spécifiques), en conformité avec le RGPD. L'Annexe A précise les modalités de traitement.",
    "Le Client Professionnel est responsable de l'utilisation conforme des services et des contenus publiés. La Société limite sa responsabilité aux dommages directs et ne garantit pas la suite des relations entre professionnels et internautes.",
    "Un système interne de traitement des plaintes est mis à disposition via la fonctionnalité « Aide », conformément au Règlement P2B.",
    "Les CGU sont régies par le droit français. En cas de litige non résolu, des médiateurs (Médiateur des entreprises, CMAP) peuvent être sollicités avant toute action devant le Tribunal de Commerce de Paris."
  ],
  "relevant_links": [
    "https://myselogerpro.com/legal-information",
    "https://myselogerpro.com/cgu",
    "https://myselogerpro.com/confidentialite",
    "https://pro-seloger.com/",
    "https://support.myselogerpro.com/",
    "https://www.mieist.finances.gouv.fr/",
    "https://www.cmap.fr/le-cmap/nous-saisir/"
  ],
  "file_name": "myselogerpro_services_terms.json"
}
```
