📄 Extracted from page: Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire
URL: https://somet1010-montoit-st-jcvj.bolt.host/proprietes/34cb9f03-4e4b-4da5-8633-8102348838f6

Extracted content:
```json
{
  "title": "Mon Toit - Plateforme de Location Immobilière en Côte d'Ivoire",
  "url": "https://somet1010-montoit-st-jcvj.bolt.host/proprietes/34cb9f03-4e4b-4da5-8633-8102348838f6",
  "summary": "This page provides detailed information about a property listed on Mon Toit, a real estate platform in Côte d'Ivoire. The listing is for a 3-bedroom, 3-bathroom duplex apartment spanning 180m² in Angré 8ème, Abidjan, Cocody, available for 650,000 FCFA/month. The property is new, located in a sought-after area, and features a spacious living room, equipped kitchen, master suite, panoramic terrace, central air conditioning, and access to a communal swimming pool and gym. The page also offers interactive options to apply, schedule a visit, or contact the platform, along with security tips for renters. Footer links provide access to general site information, legal documents, and contact details for Mon Toit.",
  "key_points": [
    "Property Type: Appartement Duplex",
    "Location: Angré 8ème, Abidjan, Cocody",
    "Price: 650,000 FCFA / mois",
    "Bedrooms: 3 Chambres",
    "Bathrooms: 3 Salles de bain",
    "Area: 180m²",
    "Description: New duplex in a desirable neighborhood, spacious living area, equipped kitchen, master suite, panoramic terrace, central AC. Residence includes a communal pool and gym.",
    "Interactive Features: 'Postuler maintenant' (Apply now) button, 'Planifier une visite' (Schedule a visit) button, 'Contacter' (Contact) button.",
    "Response Time: Generally within 24 hours.",
    "Security Tips: Visit before paying, verify owner identity, never pay cash, use Mon Toit for all payments.",
    "Mon Toit Information: Certified real estate platform for universal housing access in Côte d'Ivoire.",
    "Contact Information: +225 XX XX XX XX XX, contact@montoit.ci, Abidjan, Côte d'Ivoire.",
    "Copyright: © 2025 Mon Toit. Tous droits réservés.",
    "Certification: Certifié ANSUT.",
    "No explicit mention of API, Supabase, or network calls is present in the provided page content."
  ],
  "relevant_links": [
    "/",
    "/recherche",
    "/connexion",
    "/inscription",
    "/a-propos",
    "/comment-ca-marche",
    "/contact",
    "/conditions-utilisation",
    "/politique-confidentialite",
    "/mentions-legales",
    "/cgv",
    "/aide",
    "/faq",
    "/blog"
  ],
  "file_name": "propriete_details_angre_8eme.json"
}
```
